In [2]:
import numpy as np
import pandas as pd

In [4]:
bank = pd.read_csv('large_bank_sales.csv')

In [6]:
bank.head()

   CustomerID  Age  Income Product  Amount Region
0           1   53   83835       A    1818  North
1           2   55   52784       B    1785  South
2           3   66   79544       D    4478  North
3           4   26  115156       C    4436  South
4           5   46  111132       D    4055   East

In [10]:
bank.to_csv('new_dataset.csv', index= False)

In [16]:
bank['Income']>100000

0        False
1        False
2        False
3         True
4         True
         ...
49995    False
49996    False
49997    False
49998    False
49999    False
Name: Income, Length: 50000, dtype: bool

In [38]:
bank[(bank['Income']>100000) & (bank['Age']>50)]

       CustomerID  Age  Income Product  Amount Region
15             16   68  112207       A    3648  North
18             19   65  110147       C    1408   West
27             28   54  115208       E    2894  South
32             33   63  102704       D    1492  North
37             38   57  101431       A    2384   East
...           ...  ...     ...     ...     ...    ...
49941       49942   63  106231       D    1931   East
49970       49971   69  113070       D    1624   West
49975       49976   61  102867       A     984  North
49985       49986   67  112302       C    1999  South
49986       49987   70  114650       E    1636  North

[4394 rows x 6 columns]

In [40]:
Total_income = bank['Income'].sum()
Average_age = bank['Age'].mean()
min_age = bank['Age'].min()
max_age = bank['Age'].max()
print(f'The total income is {Total_income}')
print(f'The average age is {Average_age}')
print(f'The minimum age is {min_age}')
print(f'The maximum age is {max_age}')

The total income is 3753353995
The average age is 45.04642
The minimum age is 20
The maximum age is 70

In [42]:
bank[['Age', 'Income']]

       Age  Income
0       53   83835
1       55   52784
2       66   79544
3       26  115156
4       46  111132
...    ...     ...
49995   60   68743
49996   21   87653
49997   70   95587
49998   50   95968
49999   70   31966

[50000 rows x 2 columns]

In [44]:
bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  50000 non-null  int64
 1   Age         50000 non-null  int64
 2   Income      50000 non-null  int64
 3   Product     50000 non-null  object
 4   Amount      50000 non-null  int64
 5   Region      50000 non-null  object
dtypes: int64(4), object(2)
memory usage: 2.3+ MB

In [46]:
bank.isnull().sum()

CustomerID    0
Age           0
Income        0
Product       0
Amount        0
Region        0
dtype: int64